# Brewfile
# Relies on https://github.com/Homebrew/homebrew-bundle
# brew tap Homebrew/bundle
# brew help bundle 
cask_args appdir: '/Applications'
tap 'caskroom/cask'

# General
cask 'quicksilver'
cask '1password'
cask 'caffeine'
cask 'macvim'

# Browsers
cask 'google-chrome'
cask 'firefox'
cask 'opera'

# Terminal
cask 'iterm2'
brew 'zsh'
brew 'vim'
brew 'homebrew/dupes/screen'
brew 'tmux'
brew 'tmux-cssh'
brew 'python'
brew 'parallel'
brew 'readline'
brew 'tree'
brew 'watch'
brew 'pv'
brew 'wget'
brew 'openssl'
brew 'netcat'
brew 'nmap'

# Image Libraries
brew 'libpng'
brew 'libtiff'
brew 'libjpeg'
brew 'webp'
brew 'little-cms2'
brew 'imagemagick'

# Dev Tools
brew 'git'
cask 'sourcetree'
cask 'github-desktop'
cask 'pycharm'
cask 'java' unless system '/usr/libexec/java_home --failfast > /dev/null 2>&1'
brew 'go'
brew 'node'
brew 'mysql'
cask 'googleappengine'
cask 'google-cloud-sdk'
brew 'translate-toolkit'

