# Brewfile
# - relies on https://github.com/Homebrew/homebrew-bundle
#   brew tap Homebrew/bundle
# - install
#   brew bundle

tap 'dongminkim/kk', 'https://github.com/dongminkim/kk'

# Terminal
brew 'vim'
brew 'nvm'
brew 'python'
brew 'fd'
brew 'fzf'
brew 'ripgrep'
brew 'zoxide'
brew 'tmux'
brew 'bat'
brew 'diff-so-fancy'
brew 'difftastic'
brew 'tldr'
brew 'readline'
brew 'direnv'
brew 'jq'
brew 'dongminkim/kk/kk'

