# Brewfile
# - relies on https://github.com/Homebrew/homebrew-bundle
#   brew tap Homebrew/bundle
# - install
#   brew bundle
cask_args appdir: '/Applications'

# Terminal
brew 'coreutils'
brew 'vim'
brew 'bat'
brew 'fasd'
brew 'tldr'
brew 'python'
brew 'ctags'
brew 'readline'
brew 'wget'
brew 'openssl'
brew 'netcat'
brew 'socat'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'diff-so-fancy'
brew 'fzf'
cask 'iterm2'

